
*** Dumping AST Record Layout
         0 | class Core
         0 |   unsigned int class_id
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | class GPS_DD
         0 |   double latitude
         8 |   double longitude
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Thing
         0 |   (Thing vtable pointer)
         8 |   unsigned int model
        12 |   unsigned int sequence_num
        16 |   class GPS_DD location
        16 |     double latitude
        24 |     double longitude
        32 |   class Core (virtual base)
        32 |     unsigned int class_id
           | [sizeof=40, dsize=36, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | class Another_Thing
         0 |   (Another_Thing vtable pointer)
         8 |   unsigned int model
        12 |   unsigned int sequence_num
        16 |   class GPS_DD location
        16 |     double latitude
        24 |     double longitude
        32 |   class Core (virtual base)
        32 |     unsigned int class_id
           | [sizeof=40, dsize=36, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | class IP_Address
         0 |   unsigned int addr
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | class IOT_Thing
         0 |   class Thing (primary base)
         0 |     (Thing vtable pointer)
         8 |     unsigned int model
        12 |     unsigned int sequence_num
        16 |     class GPS_DD location
        16 |       double latitude
        24 |       double longitude
        32 |   class Another_Thing (base)
        32 |     (Another_Thing vtable pointer)
        40 |     unsigned int model
        44 |     unsigned int sequence_num
        48 |     class GPS_DD location
        48 |       double latitude
        56 |       double longitude
        64 |   class IP_Address connected
        64 |     unsigned int addr
        68 |   class Core (virtual base)
        68 |     unsigned int class_id
           | [sizeof=72, dsize=72, align=8,
           |  nvsize=68, nvalign=8]
