
*** Dumping AST Record Layout
         0 | class Core
         0 |   unsigned int class_id
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | class GPS_DD
         0 |   double latitude
         8 |   double longitude
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Thing
         0 |   class Core (base)
         0 |     unsigned int class_id
         4 |   unsigned int model
         8 |   unsigned int sequence_num
        16 |   class GPS_DD location
        16 |     double latitude
        24 |     double longitude
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | class IP_Address
         0 |   unsigned int addr
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | class IOT_Thing
         0 |   class Thing (base)
         0 |     class Core (base)
         0 |       unsigned int class_id
         4 |     unsigned int model
         8 |     unsigned int sequence_num
        16 |     class GPS_DD location
        16 |       double latitude
        24 |       double longitude
        32 |   class IP_Address connected
        32 |     unsigned int addr
           | [sizeof=40, dsize=36, align=8,
           |  nvsize=36, nvalign=8]
